// ###### 텍스트 그라데이션 하는방법 #########################################################################################################################
    background-clip: text;
    -webkit-background-clip: text;  // 텍스트 부분만 잘라냄
    -webkit-text-fill-color: transparent;   // 텍스트에도 배경 컬러를 입힘

// ######## Async(로딩)중일때 대비 #######################################################################################################################
import React, { Suspense } from 'react'

<Suspense fallback={null}>
  <Model />
</Suspense>
