// ###### 텍스트 그라데이션 하는방법 #########################################################################################################################
    background-clip: text;
    -webkit-background-clip: text;  // 텍스트 부분만 잘라냄
    -webkit-text-fill-color: transparent;   // 텍스트에도 배경 컬러를 입힘

// ######## Async(로딩)중일때 대비 #######################################################################################################################
import React, { Suspense } from 'react'

<Suspense fallback={null}>
  <Model />
</Suspense>

// ######## 박스 그림자 #######################################################################################################################
box-shadow: 1px 1px 10px 10px gray;

// box-shadow: none | x-position y-position blur spread color | inset | initial | inherit

// none : 그림자 효과를 없앤다.
// x-position : 가로 위치이다. 양수면 오른쪽에, 음수면 왼쪽에 그림자가 만들어진다. (필수)
// y-position : 세로 위치이다. 양수면 아래쪽에, 음수면 위쪽에 그림자가 만들어진다. (필수)
// blur : 그림자를 흐릿하게 만든다. 값이 클 수록 더욱 흐려진다.
// spread : 양수면 그림자를 확장하고, 음수면 축소한다.
// color : 그림자 색을 정한다.
// inset : 그림자를 요소의 안쪽에 만든다.
// initial : 기본값으로 설정한다.
// inherit : 부모 요소의 값을 상속받는다.

// ########  #######################################################################################################################
