"use client"
import React, { useState, useEffect } from 'react'
import { motion, useMotionValueEvent, useScroll } from 'framer-motion';
import '../styles/portfolio2.css'

export default function LineWithScroll() {
    const { scrollY } = useScroll()
    const [currentPath, setCurrentPath] = useState(0)

    useMotionValueEvent(scrollY, 'change', (latest) => {
        // 현재 스크롤 위치 / (전체 스크롤 높이 - 윈도우창의 높이 )
        setCurrentPath(latest/(document.body.scrollHeight-window.innerHeight))
    })

  return (
    <svg
      width="116"
      height="701"
      viewBox="0 0 116 701"
      fill="none"
      className='fixed top-0 w-full h-full'
    >
      <motion.path
        d="M35.3147 0L41.9981 210.518C34.2309 207.163 18.6965 203.305 18.6965 214.712C18.6965 226.118 25.8014 225.279 29.3538 223.434C27.7883 228.131 26.7888 237.659 35.3147 238.196C43.8406 238.733 60.1819 238.419 67.2868 238.196C67.2868 235.68 64.7579 230.547 54.6425 230.144C44.527 229.741 62.3495 235.344 72.5251 238.196H87.1564C91.5095 234.449 96.6644 227.594 82.46 230.144C68.2555 232.694 87.6203 233.667 99.0782 233.834C105.701 230.591 115.769 221.388 103.052 210.518C90.3356 199.648 80.5332 192.346 77.2216 190.053C74.0906 190.613 68.768 193.61 72.5251 201.124C76.2823 208.639 80.7138 207.611 82.46 206.157L77.2216 214.712H41.9981L46.6946 542.482C42.9013 544.104 35.3147 549.326 35.3147 557.244C35.3147 565.161 21.1049 560.543 14 557.244L25.3799 573.85L18.6965 583.076L41.9981 586.263V577.038C43.8045 578.1 51.3911 579.587 67.2868 577.038C83.1825 574.488 77.4022 582.126 72.5251 586.263H95.1043L87.1564 573.85H111V564.625C111 562.164 109.41 557.244 103.052 557.244C96.6939 557.244 86.6747 557.244 82.46 557.244C82.9416 552.1 78.0525 541.073 54.6425 538.121C31.2324 535.169 28.0292 557.02 29.3538 568.315C35.0739 572.285 53.7032 579.587 82.46 577.038C111.217 574.488 97.5729 567.7 87.1564 564.625V701"
        stroke="#892525"
        strokeWidth="5"
        initial={{ pathLength : 0 }}
        animate={{ pathLength : currentPath }}
      />
    </svg>
  )
}
